### Pandas Library

Pandas is a Python library.

Pandas is used to analyze data.
#### What is Pandas?
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

#### Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

In [ ]:
#Installation of Pandas
#pip install pandas

In [2]:
#Once Pandas is installed, import it in your applications by adding the import keyword:
import pandas as pd

### What is a Pandas Series?
A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [3]:
#Create a simple Pandas Series from a list:

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [ ]:
### Create Labels
#With the index argument, you can name your own labels.
#Create your own labels:

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

### DataFrames
Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [ ]:
#Create a simple Pandas DataFrame:

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

df

### Locate Row
As you can see from the result above, the DataFrame is like a table with rows and columns.

Pandas use the loc attribute to return one or more specified row(s)

In [ ]:
#Return row 0:

#refer to the row index:
df.loc[0]

In [ ]:
#Return row 0 and 1:

#use a list of indexes:
df.loc[[0, 1]]

In [ ]:
#Named Indexes
#With the index argument, you can name your own indexes.
#Add a list of names to give each row a name:

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

df

In [ ]:
#Locate Named Indexes
#Use the named index in the loc attribute to return the specified row(s).
#Return "day2":

#refer to the named index:
print(df.loc["day2"])

### Load Files Into a DataFrame
If your data sets are stored in a file, Pandas can load them into a DataFrame.

In [5]:
#Load a comma separated file (CSV file) into a DataFrame:

df = pd.read_excel('C:\\Users\\Udser21\\Downloads\\transaction.xlsx')

df

       transaction_id  product_id  customer_id transaction_date  online_order  \
0                   1           2         2950       2017-02-25           0.0
1                   2           3         3120       2017-05-21           1.0
2                   3          37          402       2017-10-16           0.0
3                   4          88         3135       2017-08-31           0.0
4                   5          78          787       2017-10-01           1.0
...               ...         ...          ...              ...           ...
19995           19996          51         1018       2017-06-24           1.0
19996           19997          41          127       2017-11-09           1.0
19997           19998          87         2284       2017-04-14           1.0
19998           19999           6         2764       2017-07-03           0.0
19999           20000          11         1144       2017-09-22           1.0

      order_status           brand product_line product_class product_size  \
0         Approved           Solex     Standard        medium       medium
1         Approved   Trek Bicycles     Standard        medium        large
2         Approved      OHM Cycles     Standard           low       medium
3         Approved  Norco Bicycles     Standard        medium       medium
4         Approved  Giant Bicycles     Standard        medium        large
...            ...             ...          ...           ...          ...
19995     Approved      OHM Cycles     Standard          high       medium
19996     Approved           Solex         Road        medium       medium
19997     Approved      OHM Cycles     Standard        medium       medium
19998     Approved      OHM Cycles     Standard          high       medium
19999     Approved   Trek Bicycles     Standard        medium        small

       list_price  standard_cost  product_first_sold_date
0           71.49          53.62                  41245.0
1         2091.47         388.92                  41701.0
2         1793.43         248.82                  36361.0
3         1198.46         381.10                  36145.0
4         1765.30         709.48                  42226.0
...           ...            ...                      ...
19995     2005.66        1203.40                  37823.0
19996      416.98         312.74                  35560.0
19997     1636.90          44.71                  40410.0
19998      227.88         136.73                  38216.0
19999     1775.81        1580.47                  36334.0

[20000 rows x 13 columns]

### Read CSV Files
A simple way to store big data sets is to use CSV files (comma separated files).

CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

In [ ]:
#Load the CSV into a DataFrame:

df = pd.read_csv('C:\\Users\\User21\\Downloads\\Sales_2019\\Sales_April_2019.csv')

print(df.to_string()) 
#use to_string() to print the entire DataFrame.
df

In [5]:
#Check the number of maximum returned rows:
pd.options.display.max_rows

60

### Pandas - Analyzing DataFrames

#### Viewing the Data
One of the most used method for getting a quick overview of the DataFrame, is the head() method.

The head() method returns the headers and a specified number of rows, starting from the top.

In [6]:
#Get a quick overview by printing the first 10 rows of the DataFrame:

df.head(10)

   transaction_id  product_id  customer_id transaction_date  online_order  \
0               1           2         2950       2017-02-25           0.0
1               2           3         3120       2017-05-21           1.0
2               3          37          402       2017-10-16           0.0
3               4          88         3135       2017-08-31           0.0
4               5          78          787       2017-10-01           1.0
5               6          25         2339       2017-03-08           1.0
6               7          22         1542       2017-04-21           1.0
7               8          15         2459       2017-07-15           0.0
8               9          67         1305       2017-08-10           0.0
9              10          12         3262       2017-08-30           1.0

  order_status           brand product_line product_class product_size  \
0     Approved           Solex     Standard        medium       medium
1     Approved   Trek Bicycles     Standard        medium        large
2     Approved      OHM Cycles     Standard           low       medium
3     Approved  Norco Bicycles     Standard        medium       medium
4     Approved  Giant Bicycles     Standard        medium        large
5     Approved  Giant Bicycles         Road        medium       medium
6     Approved        WeareA2B     Standard        medium       medium
7     Approved        WeareA2B     Standard        medium       medium
8     Approved           Solex     Standard        medium        large
9     Approved        WeareA2B     Standard        medium       medium

   list_price  standard_cost  product_first_sold_date
0       71.49          53.62                  41245.0
1     2091.47         388.92                  41701.0
2     1793.43         248.82                  36361.0
3     1198.46         381.10                  36145.0
4     1765.30         709.48                  42226.0
5     1538.99         829.65                  39031.0
6       60.34          45.26                  34165.0
7     1292.84          13.44                  39915.0
8     1071.23         380.74                  33455.0
9     1231.15         161.60                  38216.0

In [7]:
#There is also a tail() method for viewing the last rows of the DataFrame.
#The tail() method returns the headers and a specified number of rows, starting from the bottom.

#Print the last 5 rows of the DataFrame:

df.tail()

       transaction_id  product_id  customer_id transaction_date  online_order  \
19995           19996          51         1018       2017-06-24           1.0
19996           19997          41          127       2017-11-09           1.0
19997           19998          87         2284       2017-04-14           1.0
19998           19999           6         2764       2017-07-03           0.0
19999           20000          11         1144       2017-09-22           1.0

      order_status          brand product_line product_class product_size  \
19995     Approved     OHM Cycles     Standard          high       medium
19996     Approved          Solex         Road        medium       medium
19997     Approved     OHM Cycles     Standard        medium       medium
19998     Approved     OHM Cycles     Standard          high       medium
19999     Approved  Trek Bicycles     Standard        medium        small

       list_price  standard_cost  product_first_sold_date
19995     2005.66        1203.40                  37823.0
19996      416.98         312.74                  35560.0
19997     1636.90          44.71                  40410.0
19998      227.88         136.73                  38216.0
19999     1775.81        1580.47                  36334.0

#### Info About the Data
The DataFrames object has a method called info(), that gives you more information about the data set.

In [8]:
#Print information about the data:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB
None

#### Null Values
The isnull() method also tells us how many Non-Null values there are present in each column.

Empty values, or Null values, can be bad when analyzing data, and you should consider removing rows with empty values. This is a step towards what is called cleaning data, and you will learn more about that in the next chapters.

In [13]:
df.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                        0
product_line                 0
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

array(['Solex', 'Trek Bicycles', 'OHM Cycles', 'Norco Bicycles',
       'Giant Bicycles', 'WeareA2B', 'nan'], dtype=object)

In [11]:
#In pandas, the astype() function is used to change the data type to a desired data type
df.astype({"order_status":str}) 
df = df.astype({"brand":str, "product_line":str})

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    20000 non-null  object
 7   product_line             20000 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

### Pandas - Cleaning Data
Data cleaning means fixing bad data in your data set.

Bad data could be:

* Empty cells
* Data in wrong format
* Wrong data
* Duplicates
In this tutorial you will learn how to deal with all of them.

#### Empty Cells
Empty cells can potentially give you a wrong result when you analyze data.

Remove Rows
One way to deal with empty cells is to remove rows that contain empty cells.

This is usually OK, since data sets can be very big, and removing a few rows will not have a big impact on the result.

In [21]:
df.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                        0
product_line                 0
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [ ]:
#Return a new Data Frame with no empty cells:


new_df = df.dropna()

df
#By default, the dropna() method returns a new DataFrame, and will not change the original.

In [ ]:
#Remove all rows with NULL values:
#If you want to change the original DataFrame, use the inplace = True argument:

df.dropna(inplace = True)

df

### Replace Empty Values
Another way of dealing with empty cells is to insert a new value instead.

This way you do not have to delete entire rows just because of some empty cells.

The fillna() method allows us to replace empty cells with a value:

In [3]:
df2 = pd.read_excel('C:\\Users\\Udser21\\Downloads\\New_customer_list.xlsx')

C:\Users\Udser21\AppData\Local\Temp\ipykernel_7224\1366402019.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  df2 = pd.read_excel('C:\\Users\\Udser21\\Downloads\\New_customer_list.xlsx')

In [4]:
df2

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.40,0.5000,0.6250,0.531250,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.79,0.7900,0.9875,0.839375,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.53,0.5300,0.5300,0.530000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,1.03,1.2875,1.2875,1.287500,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.58,0.5800,0.7250,0.725000,4,4,1.703125
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,...,NSW,Australia,7,1.09,1.0900,1.0900,1.090000,996,996,0.374000
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,...,NSW,Australia,10,0.52,0.5200,0.6500,0.552500,997,997,0.357000
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,...,QLD,Australia,2,0.70,0.8750,0.8750,0.875000,997,997,0.357000
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,...,QLD,Australia,2,0.55,0.6875,0.6875,0.584375,997,997,0.357000
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,...,NSW,Australia,9,1.04,1.3000,1.6250,1.381250,1000,1000,0.340000

In [8]:
df2.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [ ]:
#Replace NULL values with the number 130:
df.fillna(130, inplace = True)

#### Replace Only For Specified Columns
The example above replaces all empty cells in the whole Data Frame.

To only replace empty values for one column, specify the column name for the DataFrame:

In [ ]:
# replace specified column
df["online_order"].fillna(130, inplace = True)

#### Replace Using Mean, Median, or Mode
A common way to replace empty cells, is to calculate the mean, median or mode value of the column.

Pandas uses the mean() median() and mode() methods to calculate the respective values for a specified column:

In [ ]:
#Calculate the MEAN, and replace any empty values with it:

x = df["Calories"].mean()

df["Calories"].fillna(x, inplace = True)

In [ ]:
#Calculate the MEDIAN, and replace any empty values with it:

x = df["Calories"].median()

df["Calories"].fillna(x, inplace = True)

In [ ]:
#Calculate the MODE, and replace any empty values with it:

x = df["Calories"].mode()[0]

df["Calories"].fillna(x, inplace = True)

### Data of Wrong Format
Cells with data of wrong format can make it difficult, or even impossible, to analyze data.

To fix it, you have two options: remove the rows, or convert all cells in the columns into the same format.
Pandas has the to_datetime() method used to coreect incorrect date.

In [22]:
#The unique() function is used to obtain the unique elements in the dataframe column
df["online_order"].unique()

array([ 0.,  1., nan])

In [ ]:
#Convert to date:

df['transaction_date '] = pd.to_datetime(df['transaction_date '])

df

In [ ]:
#To identify the row where a wrong data is contained. two methods can be applied

### Wrong Data
"Wrong data" does not have to be "empty cells" or "wrong format", it can just be wrong, like if someone registered "199" instead of "1.99".

Sometimes you can spot wrong data by looking at the data set, because you have an expectation of what it should be.

If you take a look at our data set, you can see that in row 7, the duration is 450, but for all the other rows the duration is between 30 and 60.

It doesn't have to be wrong, but taking in consideration that this is the data set of someone's workout sessions, we conclude with the fact that this person did not work out in 450 minutes.

In [ ]:
# Replacing Values
#One way to fix wrong values is to replace them with something else.

df.loc[7, 'Duration'] = 45

### Removing Rows
Another way of handling wrong data is to remove the rows that contains wrong data.

This way you do not have to find out what to replace them with, and there is a good chance you do not need them to do your analyses.

In [ ]:
#Delete rows where "Duration" is higher than 120:

for x in df.index:
  if df.loc[x, "Duration"] > 120:
    df.drop(x, inplace = True)

#### Discovering Duplicates
Duplicate rows are rows that have been registered more than one time.
To discover duplicates, we can use the duplicated() method.
The duplicated() method returns a Boolean values for each row:

In [23]:
#Returns True for every row that is a duplicate, othwerwise False:

df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
19995    False
19996    False
19997    False
19998    False
19999    False
Length: 20000, dtype: bool

In [ ]:
#to view the duplicated data
df[df.duplicated()]

In [ ]:
#To remove duplicates, use the drop_duplicates() method.
df.drop_duplicates(inplace = True)

#### Finding Relationships
A great aspect of the Pandas module is the corr() method.
The corr() method calculates the relationship between each column in your data set.

In [ ]:
#Show the relationship between the columns:

df.corr()

##### What is a good correlation? 
It depends on the use, but I think it is safe to say you have to have at least 0.6 (or -0.6) to call it a good correlation.

The groupby() function is used for grouping and aggregating data in a dataframe. It allows you to split a Dataframe into groups based on one or more columns and then performing various operations on these groups such as aggregation, transformation, or filtering. 
the syntax: grouped = df.groupby(by)
df: the dataframe you want to group
by: specifies the criteria for grouping, which can be a column name, a list of column names, a series, or a function

Once you've created a object, functions such as sum(), mean(), count(), agg(), can be applied to calculate statistics for ech groups

In [ ]:
df.groupby(["product_id "])["product_id "].count().sort_values()

### Plotting
Pandas uses the plot() method to create diagrams.

We can use Pyplot, a submodule of the Matplotlib library to visualize the diagram on the screen.

In [ ]:
#Import pyplot from Matplotlib and visualize our DataFrame:

import matplotlib.pyplot as plt

df = pd.read_csv('data.csv')

df.plot()

plt.show()

Specify the kind of plot you want with the "kind" argument:
Example
kind = 'scatter'
kind = 'bar'
kind = 'hist'